vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LPC1100_DFP.pdsc
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1114FHN33/302'  ***************************** -->
        <device Dname="LPC1114FHN33/302">
          <compile header="Device/Include/LPC11xx/LPC11xx.h"/>
          <debug svd="SVD/LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents/LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1114FHN33/203'  ***************************** -->
        <device Dname="LPC1114FHN33/203">
          <compile header="Device/Include/LPC11xx/LPC11xx.h"/>
          <debug svd="SVD/LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents/LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1114FHN33/303'  ***************************** -->
        <device Dname="LPC1114FHN33/303">
          <compile header="Device/Include/LPC11xx/LPC11xx.h"/>
          <debug svd="SVD/LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents/LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1114FHN33/333'  ***************************** -->
        <device Dname="LPC1114FHN33/333">
          <compile header="Device/Include/LPC11xx/LPC11xx.h"/>
          <debug svd="SVD/LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0xE000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_56.FLM"     start="0x00000000"  size="0xE000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents/LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1114FN28/102'  ***************************** -->
        <device Dname="LPC1114FN28/102">
          <compile header="Device/Include/LPC11xx/LPC11xx.h"/>
          <debug svd="SVD/LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents/LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="6"       m="10"/>
          <feature type="IOs"           n="22"/>
          <feature type="DIP"           n="28"/>
        </device>

        <!-- *************************  Device 'LPC1114JHN33/333'  ***************************** -->
        <device Dname="LPC1114JHN33/333">
          <compile header="Device/Include/LPC11xx/LPC11xx.h"/>
          <debug svd="SVD/LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0xE000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_56.FLM"     start="0x00000000"  size="0xE000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents/LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

