vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LPC1100_DFP.pdsc
        <!-- *************************  Device 'LPC11A04UK'  ***************************** -->
        <device Dname="LPC11A04UK">
          <compile header="Device/Include/LPC11Axx/LPC11Axx.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="SPI"           n="1"/>
          <feature type="IOs"           n="18"/>
          <feature type="CSP"           n="20"/>
        </device>

        <!-- *************************  Device 'LPC11A11FHN33/001'  ***************************** -->
        <device Dname="LPC11A11FHN33/001">
          <compile header="Device/Include/LPC11Axx/LPC11Axx.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_8.FLM"      start="0x00000000"  size="0x2000"  RAMstart="0x10000000"  RAMsize="0x07E0"  default="1"/>

          <feature type="MemoryOther"   n="1"                           name="512B EEPROM"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC11A12FBD48/101'  ***************************** -->
        <device Dname="LPC11A12FBD48/101">
          <compile header="Device/Include/LPC11Axx/LPC11Axx.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="MemoryOther"   n="1"                           name="1kB EEPROM"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="42"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'LPC11A12FHN33/101'  ***************************** -->
        <device Dname="LPC11A12FHN33/101">
          <compile header="Device/Include/LPC11Axx/LPC11Axx.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="MemoryOther"   n="1"                           name="1kB EEPROM"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC11A13FHI33/201'  ***************************** -->
        <device Dname="LPC11A13FHI33/201">
          <compile header="Device/Include/LPC11Axx/LPC11Axx.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x6000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_24.FLM"     start="0x00000000"  size="0x6000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="MemoryOther"   n="1"                           name="2kB EEPROM"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC11A14FBD48/301'  ***************************** -->
        <device Dname="LPC11A14FBD48/301">
          <compile header="Device/Include/LPC11Axx/LPC11Axx.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="42"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'LPC11A14FHN33/301'  ***************************** -->
        <device Dname="LPC11A14FHN33/301">
          <compile header="Device/Include/LPC11Axx/LPC11Axx.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC11C00'  **************************** -->
      <subFamily DsubFamily="LPC11C00">
        <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <processor Dclock="50000000"/>
        <debug svd="SVD/LPC11Cxx.svd"/>
        <book name="Documents/UM10398.pdf"      title="LPC111x/LPC11Cxx User Manual"/>
        <book name="Documents/LPC11CX2_CX4.pdf" title="LPC11Cx2/Cx4 Datasheet"/>

        <feature type="UART"          n="1"/>
        <feature type="I2C"           n="1"/>
        <feature type="SPI"           n="2"/>
        <feature type="CAN"           n="1"/>
        <feature type="ADC"           n="8"       m="10"/>
        <feature type="QFP"           n="48"/>
        <feature type="Temp"          n="-40"     m="85"/>

