vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LPC1100_DFP.pdsc
        <!-- *************************  Device 'LPC11C12FBD48/301'  ***************************** -->
        <device Dname="LPC11C12FBD48/301">
          <compile header="Device/Include/LPC11xx/LPC11xx.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="IOs"           n="40"/>
        </device>

        <!-- *************************  Device 'LPC11C14FBD48/301'  ***************************** -->
        <device Dname="LPC11C14FBD48/301">
          <compile header="Device/Include/LPC11xx/LPC11xx.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="IOs"           n="40"/>
        </device>

        <!-- *************************  Device 'LPC11C22FBD48/301'  ***************************** -->
        <device Dname="LPC11C22FBD48/301">
          <compile header="Device/Include/LPC11xx/LPC11xx.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="IOs"           n="36"/>
        </device>

        <!-- *************************  Device 'LPC11C24FBD48/301'  ***************************** -->
        <device Dname="LPC11C24FBD48/301">
          <compile header="Device/Include/LPC11xx/LPC11xx.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="IOs"           n="36"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC11D00'  **************************** -->
      <subFamily DsubFamily="LPC11D00">
        <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <processor Dclock="50000000"/>
        <debug svd="SVD/LPC11D14.svd"/>
        <book name="Documents/UM10398.pdf"  title="LPC111x/LPC11Cxx User Manual"/>
        <book name="Documents/LPC11D14.pdf" title="LPC11D14 Datasheet"/>

        <feature type="UART"          n="1"/>
        <feature type="I2C"           n="1"/>
        <feature type="SPI"           n="2"/>
        <feature type="ADC"           n="8"       m="10"/>
        <feature type="IOs"           n="42"/>
        <feature type="Temp"          n="-40"     m="85"/>

        <!-- *************************  Device 'LPC11D14FBD100/302'  ***************************** -->
        <device Dname="LPC11D14FBD100/302">
          <processor Dclock="50000000"/>
          <compile header="Device/Include/LPC11xx/LPC11xx.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="QFP"           n="100"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC11E00'  **************************** -->
      <subFamily DsubFamily="LPC11E00">
        <processor Dclock="50000000"/>

        <!-- *************************  Device 'LPC11E11FHN33/101'  ***************************** -->
        <device Dname="LPC11E11FHN33/101">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device/Include/LPC11Exx/LPC11Exx.h"/>
          <debug svd="SVD/LPC11Exx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_8.FLM"      start="0x00000000"  size="0x2000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10518.pdf"  title="LPC11Exx User Manual"/>
          <book name="Documents/LPC11E1X.pdf" title="LPC11E1x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="512B EEPROM"/>
          <feature type="I2C"           n="1"/>
          <feature type="UART"          n="1"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11E12FBD48/201'  ***************************** -->
        <device Dname="LPC11E12FBD48/201">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device/Include/LPC11Exx/LPC11Exx.h"/>
          <debug svd="SVD/LPC11Exx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10518.pdf"  title="LPC11Exx User Manual"/>
          <book name="Documents/LPC11E1X.pdf" title="LPC11E1x Datasheet"/>

