vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LPC1100_DFP.pdsc
          <feature type="MemoryOther"   n="1"                           name="1kB EEPROM"/>
          <feature type="I2C"           n="1"/>
          <feature type="UART"          n="1"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11E13FBD48/301'  ***************************** -->
        <device Dname="LPC11E13FBD48/301">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device/Include/LPC11Exx/LPC11Exx.h"/>
          <debug svd="SVD/LPC11Exx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x6000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_24.FLM"     start="0x00000000"  size="0x6000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10518.pdf"  title="LPC11Exx User Manual"/>
          <book name="Documents/LPC11E1X.pdf" title="LPC11E1x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="1kB EEPROM"/>
          <feature type="I2C"           n="1"/>
          <feature type="UART"          n="1"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11E14FBD48/401'  ***************************** -->
        <device Dname="LPC11E14FBD48/401">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device/Include/LPC11Exx/LPC11Exx.h"/>
          <debug svd="SVD/LPC11Exx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10518.pdf"  title="LPC11Exx User Manual"/>
          <book name="Documents/LPC11E1X.pdf" title="LPC11E1x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="2kB EEPROM"/>
          <feature type="I2C"           n="1"/>
          <feature type="UART"          n="1"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11E14FBD64/401'  ***************************** -->
        <device Dname="LPC11E14FBD64/401">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device/Include/LPC11Exx/LPC11Exx.h"/>
          <debug svd="SVD/LPC11Exx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10518.pdf"  title="LPC11Exx User Manual"/>
          <book name="Documents/LPC11E1X.pdf" title="LPC11E1x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="I2C"           n="1"/>
          <feature type="UART"          n="1"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="54"/>
          <feature type="QFP"           n="64"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11E14FHN33/401'  ***************************** -->
        <device Dname="LPC11E14FHN33/401">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device/Include/LPC11Exx/LPC11Exx.h"/>
          <debug svd="SVD/LPC11Exx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10518.pdf"  title="LPC11Exx User Manual"/>
          <book name="Documents/LPC11E1X.pdf" title="LPC11E1x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="2kB EEPROM"/>
          <feature type="I2C"           n="1"/>
          <feature type="UART"          n="1"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11E36FBD64/501'  ***************************** -->
        <device Dname="LPC11E36FBD64/501">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device/Include/LPC11Exx/LPC11Exx.h"/>
          <debug svd="SVD/LPC11Exx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x18000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_96.FLM"     start="0x00000000"  size="0x18000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10518.pdf"  title="LPC11Exx User Manual"/>
          <book name="Documents/LPC11E3X.pdf" title="LPC11E3x Datasheet"/>

        </device>

        <!-- *************************  Device 'LPC11E36FHN33/501'  ***************************** -->
        <device Dname="LPC11E36FHN33/501">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device/Include/LPC11Exx/LPC11Exx.h"/>
          <debug svd="SVD/LPC11Exx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x18000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_96.FLM"     start="0x00000000"  size="0x18000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10518.pdf"  title="LPC11Exx User Manual"/>
          <book name="Documents/LPC11E3X.pdf" title="LPC11E3x Datasheet"/>

        </device>

        <!-- *************************  Device 'LPC11E37FBD48/501'  ***************************** -->
        <device Dname="LPC11E37FBD48/501">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device/Include/LPC11Exx/LPC11Exx.h"/>
          <debug svd="SVD/LPC11Exx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_128.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10518.pdf"  title="LPC11Exx User Manual"/>
          <book name="Documents/LPC11E3X.pdf" title="LPC11E3x Datasheet"/>

        </device>

