vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LPC1100_DFP.pdsc
        <!-- *************************  Device 'LPC11U67JBD100'  ***************************** -->
        <device Dname="LPC11U67JBD100">
          <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device/Include/LPC11Uxx/LPC11U6x.h"/>
          <debug svd="SVD/LPC11U6x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_96_32.FLM"  start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10732.pdf"  title="LPC11U6x/E6x User Manual"/>
          <book name="Documents/LPC11U6X.pdf" title="LPC11U6x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="5"/>
          <feature type="I2C"           n="2"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="USBD"          n="1"/>
          <feature type="IOs"           n="80"/>
          <feature type="QFP"           n="100"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

        <!-- *************************  Device 'LPC11U67JBD48'  ***************************** -->
        <device Dname="LPC11U67JBD48">
          <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device/Include/LPC11Uxx/LPC11U6x.h"/>
          <debug svd="SVD/LPC11U6x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_96_32.FLM"  start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10732.pdf"  title="LPC11U6x/E6x User Manual"/>
          <book name="Documents/LPC11U6X.pdf" title="LPC11U6x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="USBD"          n="1"/>
          <feature type="IOs"           n="34"/>
          <feature type="QFP"           n="48"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

        <!-- *************************  Device 'LPC11U67JBD64'  ***************************** -->
        <device Dname="LPC11U67JBD64">
          <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device/Include/LPC11Uxx/LPC11U6x.h"/>
          <debug svd="SVD/LPC11U6x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_96_32.FLM"  start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10732.pdf"  title="LPC11U6x/E6x User Manual"/>
          <book name="Documents/LPC11U6X.pdf" title="LPC11U6x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="USBD"          n="1"/>
          <feature type="IOs"           n="48"/>
          <feature type="QFP"           n="64"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

        <!-- *************************  Device 'LPC11U68JBD100'  ***************************** -->
        <device Dname="LPC11U68JBD100">
          <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device/Include/LPC11Uxx/LPC11U6x.h"/>
          <debug svd="SVD/LPC11U6x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC1xxx_96_160.FLM" start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents/UM10732.pdf"  title="LPC11U6x/E6x User Manual"/>
          <book name="Documents/LPC11U6X.pdf" title="LPC11U6x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="5"/>
          <feature type="I2C"           n="2"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="12"      m="12"/>
          <feature type="USBD"          n="1"/>
          <feature type="IOs"           n="80"/>
          <feature type="QFP"           n="100"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

