vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LPC1100_DFP.pdsc
    <condition id="LPC11xxLV">
      <description>NXP LPC1100 Series devices</description>
      <require Dvendor="NXP:11" Dname="LPC11??LV*"/>
    </condition>

    <condition id="LPC11Axx">
      <description>NXP LPC1100 Series devices</description>
      <require Dvendor="NXP:11" Dname="LPC11A*"/>
    </condition>

    <condition id="LPC11Exx">
      <description>NXP LPC1100 Series devices</description>
      <require Dvendor="NXP:11" Dname="LPC11E*"/>
      <deny    Dvendor="NXP:11" Dname="LPC11E6*"/>
    </condition>

    <condition id="LPC11E6x">
      <description>NXP LPC1100 Series devices</description>
      <require Dvendor="NXP:11" Dname="LPC11E6*"/>
    </condition>

    <condition id="LPC11Uxx">
      <description>NXP LPC1100 Series devices</description>
      <require Dvendor="NXP:11" Dname="LPC11U*"/>
      <deny    Dvendor="NXP:11" Dname="LPC11U6*"/>
    </condition>

    <condition id="LPC11U6x">
      <description>NXP LPC1100 Series devices</description>
      <require Dvendor="NXP:11" Dname="LPC11U6*"/>
    </condition>

    <condition id="LPC112x">
      <description>NXP LPC112x Devices</description>
      <require Dvendor="NXP:11" Dname="LPC112*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="LPC11xx_Cxx CMSIS">
      <description>NXP LPC1100 Devices and CMSIS-CORE</description>
      <require condition="LPC11xx_Cxx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC11xxLV CMSIS">
      <description>NXP LPC1100 Devices and CMSIS-CORE</description>
      <require condition="LPC11xxLV"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC11Axx CMSIS">
      <description>NXP LPC1100 Devices and CMSIS-CORE</description>
      <require condition="LPC11Axx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC11Exx CMSIS">
      <description>NXP LPC1100 Devices and CMSIS-CORE</description>
      <require condition="LPC11Exx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC11E6x CMSIS">
      <description>NXP LPC1100 Devices and CMSIS-CORE</description>
      <require condition="LPC11E6x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC11Uxx CMSIS">
      <description>NXP LPC1100 Devices and CMSIS-CORE</description>
      <require condition="LPC11Uxx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC11U6x CMSIS">
      <description>NXP LPC1100 Devices and CMSIS-CORE</description>
      <require condition="LPC11U6x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC112x CMSIS">
      <description>NXP LPC112x Devices and CMSIS-CORE</description>
      <require condition="LPC112x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>


  <components>
    <!-- Startup LPC11xxLV -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC11xxLV CMSIS">
      <description>System Startup for NXP LPC1100 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/LPC11xxLV/"/>
        <!-- startup / system file -->
        <file category="sourceAsm" name="Device/Source/ARM/startup_LPC11xxLV.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_LPC11xxLV.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC11xx_Cxx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC11xx_Cxx CMSIS">
      <description>System Startup for NXP LPC1100 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/LPC11xx/"/>
        <!-- startup / system file -->
        <file category="sourceAsm" name="Device/Source/ARM/startup_LPC11xx.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_LPC11xx.c"        attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC11Axx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC11Axx CMSIS">
      <description>System Startup for NXP LPC1100 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/LPC11Axx/"/>
        <!-- startup / system file -->
        <file category="sourceAsm" name="Device/Source/ARM/startup_LPC11Axx.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_LPC11Axx.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC11Exx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC11Exx CMSIS">
      <description>System Startup for NXP LPC1100 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/LPC11Exx/"/>
        <!-- startup / system file -->
        <file category="sourceAsm" name="Device/Source/ARM/startup_LPC11Exx.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_LPC11Exx.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC11E6x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC11E6x CMSIS">
      <description>System Startup for NXP LPC1100 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/LPC11Exx/"/>
        <!-- startup / system file -->
        <file category="sourceAsm" name="Device/Source/ARM/startup_LPC11E6x.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_LPC11E6x.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

