vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LPC1100_DFP.pdsc
    <!-- Startup LPC11Uxx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC11Uxx CMSIS">
      <description>System Startup for NXP LPC1100 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/LPC11Uxx/"/>
        <!-- startup / system file -->
        <file category="sourceAsm" name="Device/Source/ARM/startup_LPC11Uxx.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_LPC11Uxx.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC11U6x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC11U6x CMSIS">
      <description>System Startup for NXP LPC1100 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/LPC11Uxx/"/>
        <!-- startup / system file -->
        <file category="sourceAsm" name="Device/Source/ARM/startup_LPC11U6x.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_LPC11U6x.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC112x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC112x CMSIS">
      <description>System Startup for NXP LPC112x Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include"  name="Device/Include/LPC112x/"/>
        <!-- startup / system file -->
        <file category="sourceAsm" name="Device/Source/ARM/startup_LPC112x.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_LPC112x.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- MCB11C14 Board Support -->
    <bundle Cbundle="MCB11C14" Cclass="Board Support" Cversion="1.0.0">
      <description>Keil MCB11C14 Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="LPC11xx_Cxx CMSIS">
      <description>LED interface for Keil MCB11C14 Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB11C14/Common/LED_MCB11C14.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="LPC11xx_Cxx CMSIS">
        <description>Buttons interface for Keil MCB11C14 Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB11C14/Common/Buttons_MCB11C14.c"/>
        </files>
      </component>
    </bundle>

    <!-- LPCXpresso1125 Board Support -->
    <bundle Cbundle="LPCXpresso1125" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPCXpresso1125 Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="LPC112x CMSIS">
      <description>LED interface for NXP LPCXpresso1125 Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso1125/Common/LED_LPCXpresso1125.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="LPC112x CMSIS">
        <description>Buttons interface for NXP LPCXpresso1125 Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso1125/Common/Buttons_LPCXpresso1125.c"/>
        </files>
      </component>
    </bundle>

    <!-- LPCXpresso11U68 Board Support -->
    <bundle Cbundle="LPCXpresso11U68" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPCXpresso11U68 Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="LPC11U6x CMSIS">
      <description>LED interface for NXP LPCXpresso11U68 Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso11U68/Common/LED_LPCXpresso11U68.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="LPC11U6x CMSIS">
        <description>Buttons interface for NXP LPCXpresso11U68 Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso11U68/Common/Buttons_LPCXpresso11U68.c"/>
        </files>
      </component>
    </bundle>

  </components>

  <boards>
    <board vendor="Keil" name="MCB11C14" revision="Ver 2.6" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCB1000=ON">
      <description>Keil MCB1000 Development Board</description>
      <image small="Boards/Keil/MCB11C14/Documents/mcb1100_small.jpg" large="Boards/Keil/MCB11C14/Documents/mcb1100_large.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcb1000/" title="MCB1100 Evaluation Board Web Page"/>
      <book category="schematic" name="Boards/Keil/MCB11C14/Documents/mcb1100-schematics.pdf" title="MCB1100 Schematics"/>
      <book category="schematic" name="Boards/Keil/MCB11C14/Documents/mcb11u10-schematics.pdf" title="MCB11U10 Schematics"/>
      <book category="manual"    name="Boards/Keil/MCB11C14/Documents/mcb1000.chm" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC11C14FBD48/301"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-Speed Device (LPC11U14 and LPC1343 only)"/>
      <feature type="CAN"             n="2"/>
      <feature type="RS232"           n="1"/>
      <feature type="Poti"            n="1"              name="Potentiometer for ADC Input"/>
      <feature type="Button"          n="4"              name="Push-Buttons: 2 x GPIO, Reset, ISP"/>
      <feature type="LED"             n="8"              name="I/O Port LEDs"/>
	  <feature type="CustomFF"        n="80" m="80"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>

    <board vendor="NXP" name="LPCXpresso1125" revision="Rev. 1" salesContact="http://www.nxp.com/support.html">
      <description>NXP LPCXpresso1125 Board</description>
      <image small="Boards/NXP/LPCXpresso1125/Documents/LPCXpresso1125_small.png"
             large="Boards/NXP/LPCXpresso1125/Documents/LPCXpresso1125_large.png"/>
      <book category="overview"  name="http://www.nxp.com/demoboard/OM13080.html"  title="LPCXpresso1125 Board"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC1125JBD48/303"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC1120"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB Virtual communications port"/>
      <feature type="LED"             n="1"              name="I/O Port RGB LED"/>
      <feature type="Button"          n="3"              name="Reset, Wake, ISP button"/>
      <feature type="Poti"            n="1"              name="Potentiometer for ADC Input"/>
      <feature type="ArduinoFF"       n="1"/>
      <feature type="ODbg"            n="1"              name="LPC-Link"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>

    <board vendor="NXP" name="LPCXpresso11U68" revision="Rev. C" salesContact="http://www.nxp.com/support.html">
      <description>NXP LPCXpresso11U68 Board</description>
      <image small="Boards/NXP/LPCXpresso11U68/Documents/LPCXpresso11U68_small.jpg"
             large="Boards/NXP/LPCXpresso11U68/Documents/LPCXpresso11U68_large.jpg"/>
      <book category="overview"  name="http://www.nxp.com/demoboard/OM13058.html"  title="LPCXpresso11U68 Board"/>
      <book category="schematic" name="Boards/NXP/LPCXpresso11U68/Documents/LPC11U68_Xpresso_v2_Schematic_RevC_1.pdf" title="LPCXpresso11U68 Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC11U68JBD100"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC11U6"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="Micro-B USB"/>
      <feature type="LED"             n="1"              name="I/O Port RGB LED"/>
      <feature type="Button"          n="3"              name="Reset, Wake, ISP button"/>
      <feature type="ArduinoFF"       n="1"/>
      <feature type="ODbg"            n="1"              name="LPC-Link"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- MCB11C14 Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Keil/MCB11C14/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCB11C14" vendor="Keil" Dvendor="NXP:11" Dname="LPC11C14FBD48/301"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- LPCXpresso1125 Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/LPCXpresso1125/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="LPCXpresso1125" vendor="NXP" Dvendor="NXP:11" Dname="LPC1125JBD48/303"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- LPCXpresso11U68 Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/LPCXpresso11U68/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="LPCXpresso11U68" vendor="NXP" Dvendor="NXP:11" Dname="LPC11U68JBD100"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

  </examples>

</package>
